#pragma once


//=============================================================================
//
// サウンド処理 [XAudio2.h]
//
//=============================================================================
#ifndef _XAUDIO2_H_
#define _XAUDIO2_H_

#include <xaudio2.h>

// サウンドファイル（ここにサウンド名を追加し、cppの方でファイルパスを順番通りに書こう！）
typedef enum
{
	//-------------------------------------------
	// BGM
	//-------------------------------------------
	BGM_BATTLE_01,		 // 戦闘01 BGM


	//-------------------------------------------
	// SE
	//-------------------------------------------
	SE_HIT_01,           // ヒット音


	SOUND_LABEL_MAX
} SOUND_LABEL;


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitSound(void);
void UninitSound(void);
void PlaySound(SOUND_LABEL label);
void StopSound(SOUND_LABEL label);
void PauseSound(SOUND_LABEL label);
void UpdateSound(void);
#endif